AUTO_config_TK_pesok/src/Documents/ТК_Приложение2КНалоговойНакладной/ТК_Приложение2КНалоговойНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_Приложение2КНалоговойНакладной</name>
  <comment>Приложение 2 к налоговой накладной (Украина)</comment>
  <basedOn>Document.ТК_НалоговаяНакладная</basedOn>
  <basedOn>Document.ВозвратОтПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиОрганизаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <comment>(Общ) Сумма НДС в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ВозвратОтПокупателя</types>
      <types>DocumentRef.ТК_НалоговаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговаяНакладная</name>
    <type>
      <types>DocumentRef.ТК_НалоговаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоВыписалНалоговуюНакладную</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПродажи</name>
    <comment>Форма гражданско-правового соглашения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПричиныНевыдачиПокупателю</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДляБухгалтерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключенаВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена без налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКорректировки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеКоличество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЦенаБезНалогов</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеСуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеСуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПричины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиНН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОрганизаций</name>
      <type>
        <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_АналитикаУчетаНоменклатурыОрганизаций/ТК_АналитикаУчетаНоменклатурыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_АналитикаУчетаНоменклатурыОрганизаций</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Documents/ТК_Приложение2КНалоговойНакладной/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ТК_НалоговаяНакладная") Тогда
		ЗаполнитьДокументНаОсновании_ТК_НалоговаяНакладная(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ЗаполнитьДокументНаОсновании_ВозвратОтПокупателя(ДанныеЗаполнения);
	Иначе
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	НалоговаяНакладная = Неопределено;
	
	НомерДляБухгалтерии = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

			
	РегистрыСведений.ТК_АналитикаУчетаНоменклатурыОрганизаций.ЗаполнитьВКоллекции(Товары,Организация);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ЭтоНовый() И Проведен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата,
		|	Док.Организация КАК Организация
		|ИЗ
		|	Документ.ТК_Приложение2КНалоговойНакладной КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДополнительныеСвойства.Вставить("СтараяДатаДокумента",  Выборка.Дата);
		ДополнительныеСвойства.Вставить("СтараяОрганизацияДокумента", Выборка.Организация);
	Иначе
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
		ДополнительныеСвойства.Вставить("ПроверкаИзмененияОрганизацииПоследовательности", Ложь);
	КонецЕсли;

	
	СуммаДокумента = Товары.Итог("ИзменениеСуммаБезНалогов");
	СуммаНДСДокумента = Товары.Итог("ИзменениеСуммаНДС");
	
	тНомерДляБухгалтерии = ОбщегоНазначенияТК.ПолучитьНомерНалоговогоДокументаДляБухгалтерии(Дата, Номер, Организация);

	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И Не Отказ И НомерДляБухгалтерии<>тНомерДляБухгалтерии ИЛИ Не ЗначениеЗаполнено(НомерДляБухгалтерии)Тогда 
		НомерДляБухгалтерии = тНомерДляБухгалтерии;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;

	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед") Тогда    
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Дата > ДополнительныеСвойства.СтараяДатаДокумента);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПроверкаИзмененияОрганизацииПоследовательности") Тогда  
		ДополнительныеСвойства.Вставить("ОрганизацияИзменена", Организация <> ДополнительныеСвойства.СтараяОрганизацияДокумента);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ХозОперация = Справочники.ХозОперации.Приложение2КНалоговойНакладнойИтоговаяРозницаОблагаемыеОперацииВозврат Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорВзаиморасчетов");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();

	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ТК_Приложение2КНалоговойНакладной.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);
	Документы.ТК_Приложение2КНалоговойНакладной.ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства);
	//
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПартииТоваровОрганизации") Тогда
		ЗапасыСервер.ОтразитьОстаткиОрганизации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПотребностиТоваровОрганизации") Тогда
		ЗапасыСервер.ОтразитьПотребностьОрганизации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;

	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УправлениеПоследовательностями.ЗарегистрироватьДокументВПоследовательностях(ДополнительныеСвойства,ПринадлежностьПоследовательностям,Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("Приложение2КНалоговойНакладнойПроведениеНаСервере",ВремяНачала,,Строка(Ссылка));

	
КонецПроцедуры





#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата				  = ТекущаяДата();
	Автор				  = Пользователи.ТекущийПользователь();
	ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	КурсДокумента         = 1;
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	//ИспользоватьЦеныИзПротоколов = ЗначениеНастроекПовтИсп.ПолучитьНастройкуПодразделения(ПодразделениеКомпании);
	СкладКомпании = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнойСклад",,СкладКомпании);	
	ХозОперация			  = ПредопределенноеЗначение("Справочник.ХозОперации.Приложение2КНалоговойНакладной");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОсновании_ТК_НалоговаяНакладная(ДанныеЗаполнения)
	
	Дата = ТекущаяДата();
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(справочник.ХозОперации.Приложение2КНалоговойНакладной) КАК ХозОперация,
	               |	ТК_НалоговаяНакладная.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ТК_НалоговаяНакладная.Организация КАК Организация,
	               |	ТК_НалоговаяНакладная.Контрагент КАК Контрагент,
	               |	ТК_НалоговаяНакладная.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ТК_НалоговаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	               |	ТК_НалоговаяНакладная.ТипЦен КАК ТипЦен,
	               |	ТК_НалоговаяНакладная.КурсДокумента КАК КурсДокумента,
	               |	ТК_НалоговаяНакладная.ТочкаДоставки КАК ТочкаДоставки,
	               |	ТК_НалоговаяНакладная.СкладКомпании КАК СкладКомпании,
	               |	ТК_НалоговаяНакладная.Ссылка КАК НалоговаяНакладная,
	               |	ТК_НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
	               |	ТК_НалоговаяНакладная.ФормаРасчетов КАК ФормаРасчетов,
	               |	ТК_НалоговаяНакладная.УсловиеПродажи КАК УсловиеПродажи,
	               |	ТК_НалоговаяНакладная.ТипПричиныНевыдачиПокупателю КАК ТипПричиныНевыдачиПокупателю,
	               |	ТК_НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных КАК ВключенаВЕдиныйРеестрНалоговыхНакладных,
	               |	ТК_НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных КАК ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
	               |	ТК_НалоговаяНакладная.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_НалоговаяНакладная.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		Коэффициент КАК Коэффициент,
	               |		Количество КАК Количество,
	               |		КоличествоБазовое КАК КоличествоБазовое,
	               |		Цена КАК Цена,
	               |		ЦенаБезНалогов КАК ЦенаБезНалогов,
	               |		СтавкаНДС КАК СтавкаНДС,
	               |		СуммаНДС КАК СуммаНДС,
	               |		СуммаБезНалогов КАК СуммаБезНалогов,
	               |		Сумма КАК Сумма,
	               |		СуммаСкидки КАК СуммаСкидки,
	               |		СуммаВсего КАК СуммаВсего,
	               |		"""" КАК ДатаКорректировки,
	               |		НомерСтрокиНН КАК НомерСтрокиНН
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная КАК ТК_НалоговаяНакладная
	               |ГДЕ
	               |	ТК_НалоговаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		тзТовары = Выборка.Товары.Выгрузить();
		тзТовары.ЗаполнитьЗначения(Дата, "ДатаКорректировки");
		
		Товары.Загрузить(тзТовары);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОсновании_ВозвратОтПокупателя(ДанныеЗаполнения)
	
	Дата = ТекущаяДата();
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(справочник.ХозОперации.Приложение2КНалоговойНакладной) КАК ХозОперация,
	               |	ТК_НалоговаяНакладная.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ТК_НалоговаяНакладная.Организация КАК Организация,
	               |	ТК_НалоговаяНакладная.Контрагент КАК Контрагент,
	               |	ТК_НалоговаяНакладная.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ТК_НалоговаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	               |	ТК_НалоговаяНакладная.ТипЦен КАК ТипЦен,
	               |	ТК_НалоговаяНакладная.КурсДокумента КАК КурсДокумента,
	               |	ТК_НалоговаяНакладная.ТочкаДоставки КАК ТочкаДоставки,
	               |	ТК_НалоговаяНакладная.СкладКомпании КАК СкладКомпании,
	               |	ТК_НалоговаяНакладная.Ссылка КАК НалоговаяНакладная,
	               |	ТК_НалоговаяНакладная.КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную,
	               |	ТК_НалоговаяНакладная.ФормаРасчетов КАК ФормаРасчетов,
	               |	ТК_НалоговаяНакладная.УсловиеПродажи КАК УсловиеПродажи,
	               |	ТК_НалоговаяНакладная.ТипПричиныНевыдачиПокупателю КАК ТипПричиныНевыдачиПокупателю,
	               |	ТК_НалоговаяНакладная.ВключенаВЕдиныйРеестрНалоговыхНакладных КАК ВключенаВЕдиныйРеестрНалоговыхНакладных,
	               |	ТК_НалоговаяНакладная.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных КАК ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
	               |	ТК_НалоговаяНакладная.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_НалоговаяНакладная.НомерДляБухгалтерии КАК НомерДляБухгалтерии
	               |ИЗ
	               |	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТК_НалоговаяНакладная КАК ТК_НалоговаяНакладная
	               |		ПО ВозвратОтПокупателя.ДокументОснование = ТК_НалоговаяНакладная.ДокументОснование
	               |ГДЕ
	               |	ВозвратОтПокупателя.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	ТК_НалоговаяНакладнаяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТК_НалоговаяНакладнаяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТК_НалоговаяНакладнаяТовары.Коэффициент КАК Коэффициент,
	               |	ТК_НалоговаяНакладнаяТовары.Количество КАК Количество,
	               |	ТК_НалоговаяНакладнаяТовары.КоличествоБазовое КАК КоличествоБазовое,
	               |	ТК_НалоговаяНакладнаяТовары.Цена КАК Цена,
	               |	ТК_НалоговаяНакладнаяТовары.ЦенаБезНалогов КАК ЦенаБезНалогов,
	               |	ТК_НалоговаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаНДС КАК СуммаНДС,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаБезНалогов КАК СуммаБезНалогов,
	               |	ТК_НалоговаяНакладнаяТовары.Сумма КАК Сумма,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаСкидки КАК СуммаСкидки,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаВсего КАК СуммаВсего,
	               |	"""" КАК ДатаКорректировки,
	               |	-ВозвратОтПокупателяТовары.Количество КАК ИзменениеКоличество,
	               |	-ВозвратОтПокупателяТовары.СуммаБезНалогов КАК ИзменениеСуммаБезНалогов,
	               |	-ВозвратОтПокупателяТовары.СуммаНДС КАК ИзменениеСуммаНДС,
	               |	ВЫБОР
	               |		КОГДА ТК_НалоговаяНакладнаяТовары.Количество = ВозвратОтПокупателяТовары.Количество
	               |			ТОГДА 103
	               |		ИНАЧЕ 102
	               |	КОНЕЦ КАК КодПричины,
	               |	ТК_НалоговаяНакладнаяТовары.НомерСтрокиНН КАК НомерСтрокиНН,
	               |	ТК_НалоговаяНакладнаяТовары.НомерСтрокиНН КАК НомерГруппы
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	               |		ПО ТК_НалоговаяНакладнаяТовары.Ссылка.ДокументОснование = ВозвратОтПокупателяТовары.Ссылка.ДокументОснование
	               |			И ТК_НалоговаяНакладнаяТовары.Номенклатура = ВозвратОтПокупателяТовары.Номенклатура
	               |ГДЕ
	               |	ВозвратОтПокупателяТовары.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка1 = МассивРезультатов[0].Выбрать();
	
	Если Выборка1.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка1);
	КонецЕсли;
	
	тзТовары = МассивРезультатов[1].Выгрузить();
	тзТовары.ЗаполнитьЗначения(Дата, "ДатаКорректировки");
		
	Товары.Загрузить(тзТовары);
		
КонецПроцедуры

#КонецОбласти






#КонецЕсли
